MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0g1/thirdparty/mspm0g1/ti/devices/msp/peripherals/hw_usb.h
/* USB_RXCSRH Bits */
/* USB_RXCSRH[INCOMPRX] Bits */
#define USB_RXCSRH_INCOMPRX_OFS                  (0)                             /* !< INCOMPRX Offset */
#define USB_RXCSRH_INCOMPRX_MASK                 ((uint8_t)0x00000001U)          /* !< This bit will be set in a
                                                                                    high-bandwidth Isochronous or
                                                                                    Interrupt transfer if the packet
                                                                                    received is incomplete, because parts
                                                                                    of the data were not received. It is
                                                                                    cleared when RXRDY is cleared. Note:
                                                                                    In anything other than Isochronous
                                                                                    transfer, this bit will always return
                                                                                    0. Note: Device and host mode. */
/* USB_RXCSRH[DT] Bits */
#define USB_RXCSRH_DT_OFS                        (1)                             /* !< DT Offset */
#define USB_RXCSRH_DT_MASK                       ((uint8_t)0x00000002U)          /* !< Data Toggle. When read, this bit
                                                                                    indicates the current state of the
                                                                                    receive data toggle. If DTWE is High,
                                                                                    this bit may be written with the
                                                                                    required setting of the data toggle.
                                                                                    If DTWE is Low, any value written to
                                                                                    this bit is ignored. Care should be
                                                                                    taken when writing to this bit as it
                                                                                    should only be changed to RESET the
                                                                                    receive endpoint. Note: Host mode
                                                                                    only. */
#define USB_RXCSRH_DT_LOW                        ((uint8_t)0x00000000U)          /* !< Data toggle is low */
#define USB_RXCSRH_DT_HIGH                       ((uint8_t)0x00000002U)          /* !< Data toggle is high */
/* USB_RXCSRH[DTWE] Bits */
#define USB_RXCSRH_DTWE_OFS                      (2)                             /* !< DTWE Offset */
#define USB_RXCSRH_DTWE_MASK                     ((uint8_t)0x00000004U)          /* !< Data Toggle Write Enable. The CPU
                                                                                    writes a 1 to this bit to enable the
                                                                                    current state of the Endpoint 0 data
                                                                                    toggle to be written. This bit is
                                                                                    automatically cleared once the new
                                                                                    value is written. Note: Host mode
                                                                                    only. */
#define USB_RXCSRH_DTWE_DISABLE                  ((uint8_t)0x00000000U)          /* !< The DT bit cannot be written. */
#define USB_RXCSRH_DTWE_ENABLE                   ((uint8_t)0x00000004U)          /* !< Enables the current state of the
                                                                                    receive endpoint data to be written
                                                                                    (see DT bit). */
/* USB_RXCSRH[DMAMOD] Bits */
#define USB_RXCSRH_DMAMOD_OFS                    (3)                             /* !< DMAMOD Offset */
#define USB_RXCSRH_DMAMOD_MASK                   ((uint8_t)0x00000008U)          /* !< DMA request mode The CPU sets this
                                                                                    bit to select DMA Request Mode 1 and
                                                                                    clears it to select DMA Request Mode
                                                                                    0. Note: This bit must not be cleared
                                                                                    either before or in the same cycle as
                                                                                    the above DMAEN bit is cleared. Note:
                                                                                    Device and host mode. */
#define USB_RXCSRH_DMAMOD_MODE0                  ((uint8_t)0x00000000U)          /* !< An interrupt is generated after
                                                                                    every DMA packet transfer. */
#define USB_RXCSRH_DMAMOD_MODE1                  ((uint8_t)0x00000008U)          /* !< An interrupt is generated only
                                                                                    after the entire DMA transfer is
                                                                                    complete. */
/* USB_RXCSRH[PIDERR] Bits */
#define USB_RXCSRH_PIDERR_OFS                    (4)                             /* !< PIDERR Offset */
#define USB_RXCSRH_PIDERR_MASK                   ((uint8_t)0x00000010U)          /* !< PID error ISO Transactions: The USB
                                                                                    controller sets this bit to indicate
                                                                                    a PID error in the received packet.
                                                                                    Bulk/Interrupt Transactions: The
                                                                                    setting of this bit is ignored. Note:
                                                                                    Device and host mode. */
#define USB_RXCSRH_PIDERR_NO_ERROR               ((uint8_t)0x00000000U)          /* !< No error */
#define USB_RXCSRH_PIDERR_ERROR                  ((uint8_t)0x00000010U)          /* !< Indicates a PID error in the
                                                                                    received packet of an isochronous
                                                                                    transaction. */
/* USB_RXCSRH[DMAEN] Bits */
#define USB_RXCSRH_DMAEN_OFS                     (5)                             /* !< DMAEN Offset */
#define USB_RXCSRH_DMAEN_MASK                    ((uint8_t)0x00000020U)          /* !< DMA Request Enable The CPU sets
                                                                                    this bit to enable the DMA request
                                                                                    for the Rx endpoint. Note: Four TX
                                                                                    and four RX endpoints can be
                                                                                    connected to the DMA module. If this
                                                                                    bit is set for a particular endpoint,
                                                                                    the TRIGARX, TRIGBRX, TRIGCRX, or
                                                                                    TRIGDRX field in the USB DMA Select
                                                                                    (USBDMASEL) register must be
                                                                                    programmed correspondingly */
#define USB_RXCSRH_DMAEN_DISABLE                 ((uint8_t)0x00000000U)          /* !< Disables the DMA request for the
                                                                                    receive endpoint. */
#define USB_RXCSRH_DMAEN_ENABLE                  ((uint8_t)0x00000020U)          /* !< Enables the DMA request for the
                                                                                    receive endpoint. */
/* USB_RXCSRH[ISOAUTORQ] Bits */
#define USB_RXCSRH_ISOAUTORQ_OFS                 (6)                             /* !< ISOAUTORQ Offset */
#define USB_RXCSRH_ISOAUTORQ_MASK                ((uint8_t)0x00000040U)          /* !< Isochronous transfer mode / Auto
                                                                                    request. Device mode: The CPU sets
                                                                                    this bit to enable the Rx endpoint
                                                                                    for Isochronous transfers, and clears
                                                                                    it to enable the Rx endpoint for
                                                                                    Bulk/Interrupt transfers. Host mode:
                                                                                    If the CPU sets this bit, the
                                                                                    STALLREQPKT bit will be automatically
                                                                                    set when the RXRDY bit is cleared. -
                                                                                    Note: This bit is automatically
                                                                                    cleared when a short packet is
                                                                                    received. */
#define USB_RXCSRH_ISOAUTORQ_DISABLE             ((uint8_t)0x00000000U)          /* !< No effect */
#define USB_RXCSRH_ISOAUTORQ_ENABLE              ((uint8_t)0x00000040U)          /* !< Sets ISO transfer mode or enables
                                                                                    the REQPKT bit to be automatically
                                                                                    set when the RXRDY bit is cleared. */
/* USB_RXCSRH[AUTOCLR] Bits */
#define USB_RXCSRH_AUTOCLR_OFS                   (7)                             /* !< AUTOCLR Offset */
#define USB_RXCSRH_AUTOCLR_MASK                  ((uint8_t)0x00000080U)          /* !< Auto Clear. If the CPU sets this
                                                                                    bit then the RXRDY bit will be
                                                                                    automatically cleared when a packet
                                                                                    of USBRXMAXP bytes has been unloaded
                                                                                    from the RX FIFO. When packets of
                                                                                    less than the maximum packet size are
                                                                                    unloaded, RXRDY will have to be
                                                                                    cleared manually. When using a DMA to
                                                                                    unload the RX-FIFO, data is read from
                                                                                    the RX-FIFO in 4 byte chunks
                                                                                    regardless of the USBRXMAXP setting.
                                                                                    Note: Device and host mode. */
#define USB_RXCSRH_AUTOCLR_DSIABLE               ((uint8_t)0x00000000U)          /* !< No effect */
#define USB_RXCSRH_AUTOCLR_ENABLE                ((uint8_t)0x00000080U)          /* !< Enables the RXRDY bit to be
                                                                                    automatically cleared when a packet
                                                                                    of USBRXMAXP[n] bytes has been
                                                                                    unloaded from the receive FIFO. */

/* USB_RXCOUNT Bits */
/* USB_RXCOUNT[COUNT] Bits */
#define USB_RXCOUNT_COUNT_OFS                    (0)                             /* !< COUNT Offset */
#define USB_RXCOUNT_COUNT_MASK                   ((uint16_t)0x00001FFFU)         /* !< Receive Packet Count indicates the
                                                                                    number of bytes in the receive
                                                                                    packet. */

