MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0g1/thirdparty/mspm0g1/ti/devices/msp/peripherals/hw_usb.h
/* USB_IDXRXTYPE Bits */
/* USB_IDXRXTYPE[DATA] Bits */
#define USB_IDXRXTYPE_DATA_OFS                   (0)                             /* !< DATA Offset */
#define USB_IDXRXTYPE_DATA_MASK                  ((uint8_t)0x000000FFU)          /* !< Control / Status register data. */

/* USB_IDXRXINTERVAL Bits */
/* USB_IDXRXINTERVAL[DATA] Bits */
#define USB_IDXRXINTERVAL_DATA_OFS               (0)                             /* !< DATA Offset */
#define USB_IDXRXINTERVAL_DATA_MASK              ((uint8_t)0x000000FFU)          /* !< Control / Status register data. */

/* USB_IDXFIFOSZ Bits */
/* USB_IDXFIFOSZ[DATA] Bits */
#define USB_IDXFIFOSZ_DATA_OFS                   (0)                             /* !< DATA Offset */
#define USB_IDXFIFOSZ_DATA_MASK                  ((uint8_t)0x000000FFU)          /* !< Control / Status register data. */

/* USB_FIFO Bits */
/* USB_FIFO[EPDATA] Bits */
#define USB_FIFO_EPDATA_OFS                      (0)                             /* !< EPDATA Offset */
#define USB_FIFO_EPDATA_MASK                     ((uint32_t)0xFFFFFFFFU)         /* !< Endpoint Data. Writing to this
                                                                                    register loads the data into the
                                                                                    Transmit FIFO and reading unloads
                                                                                    data from the Receive FIFO. */

/* USB_BYTE Bits */
/* USB_BYTE[EPDATA] Bits */
#define USB_BYTE_EPDATA_OFS                      (0)                             /* !< EPDATA Offset */
#define USB_BYTE_EPDATA_MASK                     ((uint32_t)0x000000FFU)         /* !< Endpoint Data 8-bit. */

/* USB_HALF Bits */
/* USB_HALF[EPDATA] Bits */
#define USB_HALF_EPDATA_OFS                      (0)                             /* !< EPDATA Offset */
#define USB_HALF_EPDATA_MASK                     ((uint32_t)0x0000FFFFU)         /* !< Endpoint Data 16-bit. */

/* USB_WORD Bits */
/* USB_WORD[EPDATA] Bits */
#define USB_WORD_EPDATA_OFS                      (0)                             /* !< EPDATA Offset */
#define USB_WORD_EPDATA_MASK                     ((uint32_t)0xFFFFFFFFU)         /* !< Endpoint Data 32-bit. */

/* USB_DEVCTL Bits */
/* USB_DEVCTL[SESSION] Bits */
#define USB_DEVCTL_SESSION_OFS                   (0)                             /* !< SESSION Offset */
#define USB_DEVCTL_SESSION_MASK                  ((uint8_t)0x00000001U)          /* !< Session Start/End. Host mode: This
                                                                                    bit is set or cleared by the CPU to
                                                                                    start or end a session. Device mode:
                                                                                    This bit is set/cleared by the USB
                                                                                    controller when a session
                                                                                    starts/ends. It is also set by the
                                                                                    CPU to initiate the Session Request
                                                                                    Protocol. When the USB controller is
                                                                                    in Suspend mode, the bit may be
                                                                                    cleared by the CPU to perform a
                                                                                    software disconnect.  Note: Clearing
                                                                                    this bit when the core is not
                                                                                    suspended will result in undefined
                                                                                    behavior. */
#define USB_DEVCTL_SESSION_CLEAR                 ((uint8_t)0x00000000U)          /* !< When operating as a Host: #br#When
                                                                                    cleared by software, this bit ends a
                                                                                    session. #br# #br#When operating as a
                                                                                    Device: #br#The USB controller has
                                                                                    ended a session. When the USB
                                                                                    controller is in SUSPEND mode, this
                                                                                    bit may be cleared by software to
                                                                                    perform a software disconnect. */
#define USB_DEVCTL_SESSION_SET                   ((uint8_t)0x00000001U)          /* !< When operating as a Host: #br#When
                                                                                    set by software, this bit starts a
                                                                                    session. #br# #br#When operating as a
                                                                                    Device: #br#The USB controller has
                                                                                    started a session. When set by
                                                                                    software, the Session Request
                                                                                    Protocol is initiated. #br#
                                                                                    #br#Clearing this bit when the USB
                                                                                    controller is not suspended results
                                                                                    in undefined behavior. */
/* USB_DEVCTL[HOSTREQ] Bits */
#define USB_DEVCTL_HOSTREQ_OFS                   (1)                             /* !< HOSTREQ Offset */
#define USB_DEVCTL_HOSTREQ_MASK                  ((uint8_t)0x00000002U)          /* !< When set, the USB controller will
                                                                                    initiate the Host Negotiation when
                                                                                    Suspend mode is entered.  It is
                                                                                    cleared when Host Negotiation is
                                                                                    completed. */
#define USB_DEVCTL_HOSTREQ_NO_EFFECT             ((uint8_t)0x00000000U)          /* !< No effect */
#define USB_DEVCTL_HOSTREQ_EFFECT                ((uint8_t)0x00000002U)          /* !< Initiates the Host Negotiation when
                                                                                    SUSPENDmode is entered. */
/* USB_DEVCTL[HOST] Bits */
#define USB_DEVCTL_HOST_OFS                      (2)                             /* !< HOST Offset */
#define USB_DEVCTL_HOST_MASK                     ((uint8_t)0x00000004U)          /* !< Host Mode. This Read-only bit is
                                                                                    set when the USB controller is acting
                                                                                    as a Host. Note: Only valid while a
                                                                                    session is in progress. */
#define USB_DEVCTL_HOST_DEVICE                   ((uint8_t)0x00000000U)          /* !< The USB controller is acting as a
                                                                                    Device. */
#define USB_DEVCTL_HOST_HOST                     ((uint8_t)0x00000004U)          /* !< The USB controller is acting as a
                                                                                    Host. */
/* USB_DEVCTL[VUSB] Bits */
#define USB_DEVCTL_VUSB_OFS                      (3)                             /* !< VUSB Offset */
#define USB_DEVCTL_VUSB_MASK                     ((uint8_t)0x00000018U)          /* !< VUSB / USB-PHY is powered. */
#define USB_DEVCTL_VUSB_NOT_POWERED              ((uint8_t)0x00000000U)          /* !< VUSB / USB-PHY supply is detected
                                                                                    as under 1.35V. */
#define USB_DEVCTL_VUSB_POWERED                  ((uint8_t)0x00000018U)          /* !< VUSB / USB-PHY supply is detected
                                                                                    as above 1.35V. */
/* USB_DEVCTL[LSDEV] Bits */
#define USB_DEVCTL_LSDEV_OFS                     (5)                             /* !< LSDEV Offset */
#define USB_DEVCTL_LSDEV_MASK                    ((uint8_t)0x00000020U)          /* !< Low Speed Device Detected. This
                                                                                    Read-only bit is set when a low-speed
                                                                                    device has been detected being
                                                                                    connected to the port. Note: Only
                                                                                    valid in Host mode. */
#define USB_DEVCTL_LSDEV_NO_DETCT                ((uint8_t)0x00000000U)          /* !< A low-speed Device has not been
                                                                                    detected on the port. */
#define USB_DEVCTL_LSDEV_DETCT                   ((uint8_t)0x00000020U)          /* !< A low-speed Device has been
                                                                                    detected on the port. */
/* USB_DEVCTL[FSDEV] Bits */
#define USB_DEVCTL_FSDEV_OFS                     (6)                             /* !< FSDEV Offset */
#define USB_DEVCTL_FSDEV_MASK                    ((uint8_t)0x00000040U)          /* !< Full Speed Device Detected. This
                                                                                    Read-only bit is set when a
                                                                                    full-speed device has been detected
                                                                                    being connected to the port.  Note:
                                                                                    Only valid in Host mode. */
#define USB_DEVCTL_FSDEV_NO_DETCT                ((uint8_t)0x00000000U)          /* !< A full-speed Device has not been
                                                                                    detected on the port. */
#define USB_DEVCTL_FSDEV_DETCT                   ((uint8_t)0x00000040U)          /* !< A full-speed Device has been
                                                                                    detected on the port. */
/* USB_DEVCTL[DEV] Bits */
#define USB_DEVCTL_DEV_OFS                       (7)                             /* !< DEV Offset */
#define USB_DEVCTL_DEV_MASK                      ((uint8_t)0x00000080U)          /* !< Device Mode. This Read-only bit
                                                                                    indicates whether the USB controller
                                                                                    is operating as the host mode or
                                                                                    device mode.  Note: Only valid while
                                                                                    a session is in progress. */
#define USB_DEVCTL_DEV_HOST                      ((uint8_t)0x00000000U)          /* !< The USB controller is operating in
                                                                                    host mode. */
#define USB_DEVCTL_DEV_DEVICE                    ((uint8_t)0x00000080U)          /* !< The USB controller is operating in
                                                                                    device mode. */

