MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0g1/thirdparty/mspm0g1/ti/devices/msp/peripherals/hw_usb.h
/* USB_MISC Bits */
/* USB_MISC[RX_EDMA] Bits */
#define USB_MISC_RX_EDMA_OFS                     (0)                             /* !< RX_EDMA Offset */
#define USB_MISC_RX_EDMA_MASK                    ((uint8_t)0x00000001U)          /* !< Receive early DMA mode. */
#define USB_MISC_RX_EDMA_LATE                    ((uint8_t)0x00000000U)          /* !< Late mode: DMA_REQ signal for all
                                                                                    OUT Endpoints will be de-asserted
                                                                                    when MAXP bytes have been read to an
                                                                                    endpoint. */
#define USB_MISC_RX_EDMA_EARLY                   ((uint8_t)0x00000001U)          /* !< Early Mode: DMA_REQ signal for all
                                                                                    OUT Endpoints will be de-asserted
                                                                                    when MAXP-8 bytes have been read to
                                                                                    an endpoint. */
/* USB_MISC[TX_EDMA] Bits */
#define USB_MISC_TX_EDMA_OFS                     (1)                             /* !< TX_EDMA Offset */
#define USB_MISC_TX_EDMA_MASK                    ((uint8_t)0x00000002U)          /* !< Transmit early DMA mode. */
#define USB_MISC_TX_EDMA_LATE                    ((uint8_t)0x00000000U)          /* !< Late mode: DMA_REQ signal for all
                                                                                    IN Endpoints will be de-asserted when
                                                                                    MAXP bytes have been written to an
                                                                                    endpoint. This is late mode. */
#define USB_MISC_TX_EDMA_EARLY                   ((uint8_t)0x00000002U)          /* !< Early mode: DMA_REQ signal for all
                                                                                    IN Endpoints will be de-asserted when
                                                                                    MAXP-8 bytes have been written to an
                                                                                    endpoint. This is early mode. */

/* USB_IDXTXFIFOSZ Bits */
/* USB_IDXTXFIFOSZ[SIZE] Bits */
#define USB_IDXTXFIFOSZ_SIZE_OFS                 (0)                             /* !< SIZE Offset */
#define USB_IDXTXFIFOSZ_SIZE_MASK                ((uint8_t)0x0000000FU)          /* !< Max Packet Size */
#define USB_IDXTXFIFOSZ_SIZE_BYTES_8             ((uint8_t)0x00000000U)          /* !< FIFO size 8-byte */
#define USB_IDXTXFIFOSZ_SIZE_BYTES_16            ((uint8_t)0x00000001U)          /* !< FIFO size 16-byte */
#define USB_IDXTXFIFOSZ_SIZE_BYTES_32            ((uint8_t)0x00000002U)          /* !< FIFO size 32-byte */
#define USB_IDXTXFIFOSZ_SIZE_BYTES_64            ((uint8_t)0x00000003U)          /* !< FIFO size 64-byte */
#define USB_IDXTXFIFOSZ_SIZE_BYTES_128           ((uint8_t)0x00000004U)          /* !< FIFO size 128-byte */
#define USB_IDXTXFIFOSZ_SIZE_BYTES_256           ((uint8_t)0x00000005U)          /* !< FIFO size 256-byte */
#define USB_IDXTXFIFOSZ_SIZE_BYTES_512           ((uint8_t)0x00000006U)          /* !< FIFO size 512-byte */
#define USB_IDXTXFIFOSZ_SIZE_BYTES_1024          ((uint8_t)0x00000007U)          /* !< FIFO size 1024-byte */
#define USB_IDXTXFIFOSZ_SIZE_BYTES_2048          ((uint8_t)0x00000008U)          /* !< FIFO size 2048-byte */
/* USB_IDXTXFIFOSZ[DPB] Bits */
#define USB_IDXTXFIFOSZ_DPB_OFS                  (4)                             /* !< DPB Offset */
#define USB_IDXTXFIFOSZ_DPB_MASK                 ((uint8_t)0x00000010U)          /* !< Double Packet Buffer Support */
#define USB_IDXTXFIFOSZ_DPB_SIGLE                ((uint8_t)0x00000000U)          /* !< Single packet buffering is
                                                                                    supported. */
#define USB_IDXTXFIFOSZ_DPB_DOUBLE               ((uint8_t)0x00000010U)          /* !< Double packet buffering is enabled. */

/* USB_IDXRXFIFOSZ Bits */
/* USB_IDXRXFIFOSZ[SIZE] Bits */
#define USB_IDXRXFIFOSZ_SIZE_OFS                 (0)                             /* !< SIZE Offset */
#define USB_IDXRXFIFOSZ_SIZE_MASK                ((uint8_t)0x0000000FU)          /* !< Maximum packet size to be allowed.
                                                                                    If DPB = 0, the FIFO also is this
                                                                                    size; if DPB = 1, the FIFO is twice
                                                                                    this size. Packet size in bytes: */
#define USB_IDXRXFIFOSZ_SIZE_BYTES_8             ((uint8_t)0x00000000U)          /* !< FIFO size 8-byte */
#define USB_IDXRXFIFOSZ_SIZE_BYTES_16            ((uint8_t)0x00000001U)          /* !< FIFO size 16-byte */
#define USB_IDXRXFIFOSZ_SIZE_BYTES_32            ((uint8_t)0x00000002U)          /* !< FIFO size 32-byte */
#define USB_IDXRXFIFOSZ_SIZE_BYTES_64            ((uint8_t)0x00000003U)          /* !< FIFO size 64-byte */
#define USB_IDXRXFIFOSZ_SIZE_BYTES_128           ((uint8_t)0x00000004U)          /* !< FIFO size 128-byte */
#define USB_IDXRXFIFOSZ_SIZE_BYTES_256           ((uint8_t)0x00000005U)          /* !< FIFO size 256-byte */
#define USB_IDXRXFIFOSZ_SIZE_BYTES_512           ((uint8_t)0x00000006U)          /* !< FIFO size 512-byte */
#define USB_IDXRXFIFOSZ_SIZE_BYTES_1024          ((uint8_t)0x00000007U)          /* !< FIFO size 1024-byte */
#define USB_IDXRXFIFOSZ_SIZE_BYTES_2048          ((uint8_t)0x00000008U)          /* !< FIFO size 2048-byte */
/* USB_IDXRXFIFOSZ[DPB] Bits */
#define USB_IDXRXFIFOSZ_DPB_OFS                  (4)                             /* !< DPB Offset */
#define USB_IDXRXFIFOSZ_DPB_MASK                 ((uint8_t)0x00000010U)          /* !< Double Packet Buffer Support */
#define USB_IDXRXFIFOSZ_DPB_SIGLE                ((uint8_t)0x00000000U)          /* !< Single packet buffering is
                                                                                    supported. */
#define USB_IDXRXFIFOSZ_DPB_DOUBLE               ((uint8_t)0x00000010U)          /* !< Double packet buffering is enabled. */

