MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0g1/thirdparty/mspm0g1/ti/devices/msp/peripherals/hw_usb.h
/* USB_IDXTXFIFOADD Bits */
/* USB_IDXTXFIFOADD[ADDR] Bits */
#define USB_IDXTXFIFOADD_ADDR_OFS                (0)                             /* !< ADDR Offset */
#define USB_IDXTXFIFOADD_ADDR_MASK               ((uint16_t)0x00003FFFU)         /* !< Endpoint Data */
#define USB_IDXTXFIFOADD_ADDR_ADDR_0             ((uint16_t)0x00000000U)         /* !< 0.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_8             ((uint16_t)0x00000001U)         /* !< 8.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_16            ((uint16_t)0x00000002U)         /* !< 16.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_24            ((uint16_t)0x00000003U)         /* !< 24.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_32            ((uint16_t)0x00000004U)         /* !< 32.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_40            ((uint16_t)0x00000005U)         /* !< 40.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_48            ((uint16_t)0x00000006U)         /* !< 48.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_56            ((uint16_t)0x00000007U)         /* !< 56.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_64            ((uint16_t)0x00000008U)         /* !< 64.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_72            ((uint16_t)0x00000009U)         /* !< 72.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_80            ((uint16_t)0x0000000AU)         /* !< 80.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_88            ((uint16_t)0x0000000BU)         /* !< 88.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_96            ((uint16_t)0x0000000CU)         /* !< 96.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_104           ((uint16_t)0x0000000DU)         /* !< 104.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_112           ((uint16_t)0x0000000EU)         /* !< 112.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_120           ((uint16_t)0x0000000FU)         /* !< 120.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_128           ((uint16_t)0x00000010U)         /* !< 128.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_136           ((uint16_t)0x00000011U)         /* !< 136.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_144           ((uint16_t)0x00000012U)         /* !< 144.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_152           ((uint16_t)0x00000013U)         /* !< 152.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_160           ((uint16_t)0x00000014U)         /* !< 160.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_168           ((uint16_t)0x00000015U)         /* !< 168.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_176           ((uint16_t)0x00000016U)         /* !< 176.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_184           ((uint16_t)0x00000017U)         /* !< 184.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_192           ((uint16_t)0x00000018U)         /* !< 192.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_200           ((uint16_t)0x00000019U)         /* !< 200.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_208           ((uint16_t)0x0000001AU)         /* !< 208.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_216           ((uint16_t)0x0000001BU)         /* !< 216.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_224           ((uint16_t)0x0000001CU)         /* !< 224.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_232           ((uint16_t)0x0000001DU)         /* !< 232.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_240           ((uint16_t)0x0000001EU)         /* !< 240.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_248           ((uint16_t)0x0000001FU)         /* !< 248.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_256           ((uint16_t)0x00000020U)         /* !< 256.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_264           ((uint16_t)0x00000021U)         /* !< 264.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_272           ((uint16_t)0x00000022U)         /* !< 272.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_280           ((uint16_t)0x00000023U)         /* !< 280.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_288           ((uint16_t)0x00000024U)         /* !< 288.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_296           ((uint16_t)0x00000025U)         /* !< 296.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_304           ((uint16_t)0x00000026U)         /* !< 304.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_312           ((uint16_t)0x00000027U)         /* !< 312.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_320           ((uint16_t)0x00000028U)         /* !< 320.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_328           ((uint16_t)0x00000029U)         /* !< 328.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_336           ((uint16_t)0x0000002AU)         /* !< 336.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_344           ((uint16_t)0x0000002BU)         /* !< 344.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_352           ((uint16_t)0x0000002CU)         /* !< 352.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_360           ((uint16_t)0x0000002DU)         /* !< 360.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_368           ((uint16_t)0x0000002EU)         /* !< 368.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_376           ((uint16_t)0x0000002FU)         /* !< 376.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_384           ((uint16_t)0x00000030U)         /* !< 384.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_392           ((uint16_t)0x00000031U)         /* !< 392.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_400           ((uint16_t)0x00000032U)         /* !< 400.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_408           ((uint16_t)0x00000033U)         /* !< 408.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_416           ((uint16_t)0x00000034U)         /* !< 416.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_424           ((uint16_t)0x00000035U)         /* !< 424.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_432           ((uint16_t)0x00000036U)         /* !< 432.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_440           ((uint16_t)0x00000037U)         /* !< 440.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_448           ((uint16_t)0x00000038U)         /* !< 448.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_456           ((uint16_t)0x00000039U)         /* !< 456.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_464           ((uint16_t)0x0000003AU)         /* !< 464.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_472           ((uint16_t)0x0000003BU)         /* !< 472.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_480           ((uint16_t)0x0000003CU)         /* !< 480.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_488           ((uint16_t)0x0000003DU)         /* !< 488.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_496           ((uint16_t)0x0000003EU)         /* !< 496.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_504           ((uint16_t)0x0000003FU)         /* !< 504.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_512           ((uint16_t)0x00000040U)         /* !< 512.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_520           ((uint16_t)0x00000041U)         /* !< 520.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_528           ((uint16_t)0x00000042U)         /* !< 528.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_536           ((uint16_t)0x00000043U)         /* !< 536.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_544           ((uint16_t)0x00000044U)         /* !< 544.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_552           ((uint16_t)0x00000045U)         /* !< 552.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_560           ((uint16_t)0x00000046U)         /* !< 560.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_568           ((uint16_t)0x00000047U)         /* !< 568.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_576           ((uint16_t)0x00000048U)         /* !< 576.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_584           ((uint16_t)0x00000049U)         /* !< 584.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_592           ((uint16_t)0x0000004AU)         /* !< 592.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_600           ((uint16_t)0x0000004BU)         /* !< 600.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_608           ((uint16_t)0x0000004CU)         /* !< 608.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_616           ((uint16_t)0x0000004DU)         /* !< 616.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_624           ((uint16_t)0x0000004EU)         /* !< 624.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_632           ((uint16_t)0x0000004FU)         /* !< 632.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_640           ((uint16_t)0x00000050U)         /* !< 640.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_648           ((uint16_t)0x00000051U)         /* !< 648.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_656           ((uint16_t)0x00000052U)         /* !< 656.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_664           ((uint16_t)0x00000053U)         /* !< 664.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_672           ((uint16_t)0x00000054U)         /* !< 672.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_680           ((uint16_t)0x00000055U)         /* !< 680.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_688           ((uint16_t)0x00000056U)         /* !< 688.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_696           ((uint16_t)0x00000057U)         /* !< 696.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_704           ((uint16_t)0x00000058U)         /* !< 704.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_712           ((uint16_t)0x00000059U)         /* !< 712.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_720           ((uint16_t)0x0000005AU)         /* !< 720.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_728           ((uint16_t)0x0000005BU)         /* !< 728.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_736           ((uint16_t)0x0000005CU)         /* !< 736.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_744           ((uint16_t)0x0000005DU)         /* !< 744.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_752           ((uint16_t)0x0000005EU)         /* !< 752.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_760           ((uint16_t)0x0000005FU)         /* !< 760.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_768           ((uint16_t)0x00000060U)         /* !< 768.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_776           ((uint16_t)0x00000061U)         /* !< 776.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_784           ((uint16_t)0x00000062U)         /* !< 784.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_792           ((uint16_t)0x00000063U)         /* !< 792.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_800           ((uint16_t)0x00000064U)         /* !< 800.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_808           ((uint16_t)0x00000065U)         /* !< 808.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_816           ((uint16_t)0x00000066U)         /* !< 816.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_824           ((uint16_t)0x00000067U)         /* !< 824.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_832           ((uint16_t)0x00000068U)         /* !< 832.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_840           ((uint16_t)0x00000069U)         /* !< 840.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_848           ((uint16_t)0x0000006AU)         /* !< 848.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_856           ((uint16_t)0x0000006BU)         /* !< 856.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_864           ((uint16_t)0x0000006CU)         /* !< 864.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_872           ((uint16_t)0x0000006DU)         /* !< 872.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_880           ((uint16_t)0x0000006EU)         /* !< 880.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_888           ((uint16_t)0x0000006FU)         /* !< 888.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_896           ((uint16_t)0x00000070U)         /* !< 896.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_904           ((uint16_t)0x00000071U)         /* !< 904.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_912           ((uint16_t)0x00000072U)         /* !< 912.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_920           ((uint16_t)0x00000073U)         /* !< 920.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_928           ((uint16_t)0x00000074U)         /* !< 928.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_936           ((uint16_t)0x00000075U)         /* !< 936.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_944           ((uint16_t)0x00000076U)         /* !< 944.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_952           ((uint16_t)0x00000077U)         /* !< 952.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_960           ((uint16_t)0x00000078U)         /* !< 960.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_968           ((uint16_t)0x00000079U)         /* !< 968.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_976           ((uint16_t)0x0000007AU)         /* !< 976.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_984           ((uint16_t)0x0000007BU)         /* !< 984.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_992           ((uint16_t)0x0000007CU)         /* !< 992.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1000          ((uint16_t)0x0000007DU)         /* !< 1000.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1008          ((uint16_t)0x0000007EU)         /* !< 1008.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1016          ((uint16_t)0x0000007FU)         /* !< 1016.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1024          ((uint16_t)0x00000080U)         /* !< 1024.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1032          ((uint16_t)0x00000081U)         /* !< 1032.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1040          ((uint16_t)0x00000082U)         /* !< 1040.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1048          ((uint16_t)0x00000083U)         /* !< 1048.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1056          ((uint16_t)0x00000084U)         /* !< 1056.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1064          ((uint16_t)0x00000085U)         /* !< 1064.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1072          ((uint16_t)0x00000086U)         /* !< 1072.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1080          ((uint16_t)0x00000087U)         /* !< 1080.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1088          ((uint16_t)0x00000088U)         /* !< 1088.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1096          ((uint16_t)0x00000089U)         /* !< 1096.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1104          ((uint16_t)0x0000008AU)         /* !< 1104.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1112          ((uint16_t)0x0000008BU)         /* !< 1112.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1120          ((uint16_t)0x0000008CU)         /* !< 1120.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1128          ((uint16_t)0x0000008DU)         /* !< 1128.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1136          ((uint16_t)0x0000008EU)         /* !< 1136.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1144          ((uint16_t)0x0000008FU)         /* !< 1144.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1152          ((uint16_t)0x00000090U)         /* !< 1152.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1160          ((uint16_t)0x00000091U)         /* !< 1160.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1168          ((uint16_t)0x00000092U)         /* !< 1168.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1176          ((uint16_t)0x00000093U)         /* !< 1176.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1184          ((uint16_t)0x00000094U)         /* !< 1184.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1192          ((uint16_t)0x00000095U)         /* !< 1192.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1200          ((uint16_t)0x00000096U)         /* !< 1200.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1208          ((uint16_t)0x00000097U)         /* !< 1208.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1216          ((uint16_t)0x00000098U)         /* !< 1216.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1224          ((uint16_t)0x00000099U)         /* !< 1224.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1232          ((uint16_t)0x0000009AU)         /* !< 1232.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1240          ((uint16_t)0x0000009BU)         /* !< 1240.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1248          ((uint16_t)0x0000009CU)         /* !< 1248.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1256          ((uint16_t)0x0000009DU)         /* !< 1256.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1264          ((uint16_t)0x0000009EU)         /* !< 1264.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1272          ((uint16_t)0x0000009FU)         /* !< 1272.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1280          ((uint16_t)0x000000A0U)         /* !< 1280.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1288          ((uint16_t)0x000000A1U)         /* !< 1288.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1296          ((uint16_t)0x000000A2U)         /* !< 1296.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1304          ((uint16_t)0x000000A3U)         /* !< 1304.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1312          ((uint16_t)0x000000A4U)         /* !< 1312.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1320          ((uint16_t)0x000000A5U)         /* !< 1320.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1328          ((uint16_t)0x000000A6U)         /* !< 1328.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1336          ((uint16_t)0x000000A7U)         /* !< 1336.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1344          ((uint16_t)0x000000A8U)         /* !< 1344.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1352          ((uint16_t)0x000000A9U)         /* !< 1352.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1360          ((uint16_t)0x000000AAU)         /* !< 1360.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1368          ((uint16_t)0x000000ABU)         /* !< 1368.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1376          ((uint16_t)0x000000ACU)         /* !< 1376.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1384          ((uint16_t)0x000000ADU)         /* !< 1384.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1392          ((uint16_t)0x000000AEU)         /* !< 1392.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1400          ((uint16_t)0x000000AFU)         /* !< 1400.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1408          ((uint16_t)0x000000B0U)         /* !< 1408.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1416          ((uint16_t)0x000000B1U)         /* !< 1416.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1424          ((uint16_t)0x000000B2U)         /* !< 1424.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1432          ((uint16_t)0x000000B3U)         /* !< 1432.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1440          ((uint16_t)0x000000B4U)         /* !< 1440.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1448          ((uint16_t)0x000000B5U)         /* !< 1448.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1456          ((uint16_t)0x000000B6U)         /* !< 1456.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1464          ((uint16_t)0x000000B7U)         /* !< 1464.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1472          ((uint16_t)0x000000B8U)         /* !< 1472.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1480          ((uint16_t)0x000000B9U)         /* !< 1480.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1488          ((uint16_t)0x000000BAU)         /* !< 1488.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1496          ((uint16_t)0x000000BBU)         /* !< 1496.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1504          ((uint16_t)0x000000BCU)         /* !< 1504.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1512          ((uint16_t)0x000000BDU)         /* !< 1512.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1520          ((uint16_t)0x000000BEU)         /* !< 1520.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1528          ((uint16_t)0x000000BFU)         /* !< 1528.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1536          ((uint16_t)0x000000C0U)         /* !< 1536.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1544          ((uint16_t)0x000000C1U)         /* !< 1544.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1552          ((uint16_t)0x000000C2U)         /* !< 1552.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1560          ((uint16_t)0x000000C3U)         /* !< 1560.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1568          ((uint16_t)0x000000C4U)         /* !< 1568.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1576          ((uint16_t)0x000000C5U)         /* !< 1576.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1584          ((uint16_t)0x000000C6U)         /* !< 1584.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1592          ((uint16_t)0x000000C7U)         /* !< 1592.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1600          ((uint16_t)0x000000C8U)         /* !< 1600.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1608          ((uint16_t)0x000000C9U)         /* !< 1608.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1616          ((uint16_t)0x000000CAU)         /* !< 1616.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1624          ((uint16_t)0x000000CBU)         /* !< 1624.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1632          ((uint16_t)0x000000CCU)         /* !< 1632.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1640          ((uint16_t)0x000000CDU)         /* !< 1640.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1648          ((uint16_t)0x000000CEU)         /* !< 1648.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1656          ((uint16_t)0x000000CFU)         /* !< 1656.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1664          ((uint16_t)0x000000D0U)         /* !< 1664.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1672          ((uint16_t)0x000000D1U)         /* !< 1672.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1680          ((uint16_t)0x000000D2U)         /* !< 1680.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1688          ((uint16_t)0x000000D3U)         /* !< 1688.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1696          ((uint16_t)0x000000D4U)         /* !< 1696.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1704          ((uint16_t)0x000000D5U)         /* !< 1704.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1712          ((uint16_t)0x000000D6U)         /* !< 1712.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1720          ((uint16_t)0x000000D7U)         /* !< 1720.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1728          ((uint16_t)0x000000D8U)         /* !< 1728.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1736          ((uint16_t)0x000000D9U)         /* !< 1736.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1744          ((uint16_t)0x000000DAU)         /* !< 1744.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1752          ((uint16_t)0x000000DBU)         /* !< 1752.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1760          ((uint16_t)0x000000DCU)         /* !< 1760.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1768          ((uint16_t)0x000000DDU)         /* !< 1768.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1776          ((uint16_t)0x000000DEU)         /* !< 1776.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1784          ((uint16_t)0x000000DFU)         /* !< 1784.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1792          ((uint16_t)0x000000E0U)         /* !< 1792.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1800          ((uint16_t)0x000000E1U)         /* !< 1800.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1808          ((uint16_t)0x000000E2U)         /* !< 1808.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1816          ((uint16_t)0x000000E3U)         /* !< 1816.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1824          ((uint16_t)0x000000E4U)         /* !< 1824.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1832          ((uint16_t)0x000000E5U)         /* !< 1832.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1840          ((uint16_t)0x000000E6U)         /* !< 1840.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1848          ((uint16_t)0x000000E7U)         /* !< 1848.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1856          ((uint16_t)0x000000E8U)         /* !< 1856.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1864          ((uint16_t)0x000000E9U)         /* !< 1864.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1872          ((uint16_t)0x000000EAU)         /* !< 1872.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1880          ((uint16_t)0x000000EBU)         /* !< 1880.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1888          ((uint16_t)0x000000ECU)         /* !< 1888.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1896          ((uint16_t)0x000000EDU)         /* !< 1896.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1904          ((uint16_t)0x000000EEU)         /* !< 1904.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1912          ((uint16_t)0x000000EFU)         /* !< 1912.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1920          ((uint16_t)0x000000F0U)         /* !< 1920.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1928          ((uint16_t)0x000000F1U)         /* !< 1928.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1936          ((uint16_t)0x000000F2U)         /* !< 1936.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1944          ((uint16_t)0x000000F3U)         /* !< 1944.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1952          ((uint16_t)0x000000F4U)         /* !< 1952.0 */
#define USB_IDXTXFIFOADD_ADDR_ADDR_1960          ((uint16_t)0x000000F5U)         /* !< 1960.0 */
