MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0g1/thirdparty/mspm0g1/ti/devices/msp/peripherals/hw_usb.h
/* USB_TXDPKTBUFDIS Bits */
/* USB_TXDPKTBUFDIS[EP1] Bits */
#define USB_TXDPKTBUFDIS_EP1_OFS                 (1)                             /* !< EP1 Offset */
#define USB_TXDPKTBUFDIS_EP1_MASK                ((uint16_t)0x00000002U)         /* !< EP1 TX Double Packet Buffer Disable */
#define USB_TXDPKTBUFDIS_EP1_DISABLE             ((uint16_t)0x00000000U)         /* !< Disables double-packet buffering. */
#define USB_TXDPKTBUFDIS_EP1_ENABLE              ((uint16_t)0x00000002U)         /* !< Enables double-packet buffering. */
/* USB_TXDPKTBUFDIS[EP2] Bits */
#define USB_TXDPKTBUFDIS_EP2_OFS                 (2)                             /* !< EP2 Offset */
#define USB_TXDPKTBUFDIS_EP2_MASK                ((uint16_t)0x00000004U)         /* !< EP2 TX Double Packet Buffer Disable */
#define USB_TXDPKTBUFDIS_EP2_DISABLE             ((uint16_t)0x00000000U)         /* !< Disables double-packet buffering. */
#define USB_TXDPKTBUFDIS_EP2_ENABLE              ((uint16_t)0x00000004U)         /* !< Enables double-packet buffering. */
/* USB_TXDPKTBUFDIS[EP3] Bits */
#define USB_TXDPKTBUFDIS_EP3_OFS                 (3)                             /* !< EP3 Offset */
#define USB_TXDPKTBUFDIS_EP3_MASK                ((uint16_t)0x00000008U)         /* !< EP3 TX Double Packet Buffer Disable */
#define USB_TXDPKTBUFDIS_EP3_DISABLE             ((uint16_t)0x00000000U)         /* !< Disables double-packet buffering. */
#define USB_TXDPKTBUFDIS_EP3_ENABLE              ((uint16_t)0x00000008U)         /* !< Enables double-packet buffering. */
/* USB_TXDPKTBUFDIS[EP4] Bits */
#define USB_TXDPKTBUFDIS_EP4_OFS                 (4)                             /* !< EP4 Offset */
#define USB_TXDPKTBUFDIS_EP4_MASK                ((uint16_t)0x00000010U)         /* !< EP4 TX Double Packet Buffer Disable */
#define USB_TXDPKTBUFDIS_EP4_DISABLE             ((uint16_t)0x00000000U)         /* !< Disables double-packet buffering. */
#define USB_TXDPKTBUFDIS_EP4_ENABLE              ((uint16_t)0x00000010U)         /* !< Enables double-packet buffering. */
/* USB_TXDPKTBUFDIS[EP5] Bits */
#define USB_TXDPKTBUFDIS_EP5_OFS                 (5)                             /* !< EP5 Offset */
#define USB_TXDPKTBUFDIS_EP5_MASK                ((uint16_t)0x00000020U)         /* !< EP5 TX Double Packet Buffer Disable */
#define USB_TXDPKTBUFDIS_EP5_DISABLE             ((uint16_t)0x00000000U)         /* !< Disables double-packet buffering. */
#define USB_TXDPKTBUFDIS_EP5_ENABLE              ((uint16_t)0x00000020U)         /* !< Enables double-packet buffering. */
/* USB_TXDPKTBUFDIS[EP6] Bits */
#define USB_TXDPKTBUFDIS_EP6_OFS                 (6)                             /* !< EP6 Offset */
#define USB_TXDPKTBUFDIS_EP6_MASK                ((uint16_t)0x00000040U)         /* !< EP6 TX Double Packet Buffer Disable */
#define USB_TXDPKTBUFDIS_EP6_DISABLE             ((uint16_t)0x00000000U)         /* !< Disables double-packet buffering. */
#define USB_TXDPKTBUFDIS_EP6_ENABLE              ((uint16_t)0x00000040U)         /* !< Enables double-packet buffering. */
/* USB_TXDPKTBUFDIS[EP7] Bits */
#define USB_TXDPKTBUFDIS_EP7_OFS                 (7)                             /* !< EP7 Offset */
#define USB_TXDPKTBUFDIS_EP7_MASK                ((uint16_t)0x00000080U)         /* !< EP7 TX Double Packet Buffer Disable */
#define USB_TXDPKTBUFDIS_EP7_DISABLE             ((uint16_t)0x00000000U)         /* !< Disables double-packet buffering. */
#define USB_TXDPKTBUFDIS_EP7_ENABLE              ((uint16_t)0x00000080U)         /* !< Enables double-packet buffering. */

/* USB_IIDX Bits */
/* USB_IIDX[STAT] Bits */
#define USB_IIDX_STAT_OFS                        (0)                             /* !< STAT Offset */
#define USB_IIDX_STAT_MASK                       ((uint32_t)0x000000FFU)         /* !< Interrupt index status */
#define USB_IIDX_STAT_NO_INTR                    ((uint32_t)0x00000000U)         /* !< No bit is set means there is no
                                                                                    pending interrupt request */
#define USB_IIDX_STAT_INTRTX                     ((uint32_t)0x00000001U)         /* !< Endpoint 0 and the TX Endpoints
                                                                                    interrupt */
#define USB_IIDX_STAT_INTRRX                     ((uint32_t)0x00000002U)         /* !< RX Endpoints interrupt */
#define USB_IIDX_STAT_INTRUSB                    ((uint32_t)0x00000003U)         /* !< USB Interrupts */
#define USB_IIDX_STAT_VUSBPWRDN                  ((uint32_t)0x00000004U)         /* !< VUSB power down */
#define USB_IIDX_STAT_DMADONEARX                 ((uint32_t)0x00000005U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-A-RX */
#define USB_IIDX_STAT_DMADONEATX                 ((uint32_t)0x00000006U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-A-TX */
#define USB_IIDX_STAT_DMADONEBRX                 ((uint32_t)0x00000007U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-B-RX */
#define USB_IIDX_STAT_DMADONEBTX                 ((uint32_t)0x00000008U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-B-TX */
#define USB_IIDX_STAT_DMADONECRX                 ((uint32_t)0x00000009U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-C-RX */
#define USB_IIDX_STAT_DMADONECTX                 ((uint32_t)0x0000000AU)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-C-TX */
#define USB_IIDX_STAT_DMADONEDRX                 ((uint32_t)0x0000000BU)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-D-RX */
#define USB_IIDX_STAT_DMADONEDTX                 ((uint32_t)0x0000000CU)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-D-TX */
#define USB_IIDX_STAT_DMAPREARX                  ((uint32_t)0x0000000DU)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-A-RX */
#define USB_IIDX_STAT_DMAPREATX                  ((uint32_t)0x0000000EU)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-A-TX */
#define USB_IIDX_STAT_DMAPREBRX                  ((uint32_t)0x0000000FU)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-B-RX */
#define USB_IIDX_STAT_DMAPREBTX                  ((uint32_t)0x00000010U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-B-TX */
#define USB_IIDX_STAT_DMAPRECRX                  ((uint32_t)0x00000011U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-C-RX */
#define USB_IIDX_STAT_DMAPRECTX                  ((uint32_t)0x00000012U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-C-TX */
#define USB_IIDX_STAT_DMAPREDRX                  ((uint32_t)0x00000013U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-D-RX */
#define USB_IIDX_STAT_DMAPREDTX                  ((uint32_t)0x00000014U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-D-TX */

