MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0g1/thirdparty/mspm0g1/ti/devices/msp/peripherals/hw_usb.h
/* USB_IMASK Bits */
/* USB_IMASK[INTRTX] Bits */
#define USB_IMASK_INTRTX_OFS                     (0)                             /* !< INTRTX Offset */
#define USB_IMASK_INTRTX_MASK                    ((uint32_t)0x00000001U)         /* !< Endpoint 0 and the TX Endpoints
                                                                                    interrupt */
#define USB_IMASK_INTRTX_CLR                     ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USB_IMASK_INTRTX_SET                     ((uint32_t)0x00000001U)         /* !< Interrupt Enabled. */
/* USB_IMASK[INTRRX] Bits */
#define USB_IMASK_INTRRX_OFS                     (1)                             /* !< INTRRX Offset */
#define USB_IMASK_INTRRX_MASK                    ((uint32_t)0x00000002U)         /* !< RX Endpoints interrupt */
#define USB_IMASK_INTRRX_CLR                     ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USB_IMASK_INTRRX_SET                     ((uint32_t)0x00000002U)         /* !< Interrupt Enabled. */
/* USB_IMASK[INTRUSB] Bits */
#define USB_IMASK_INTRUSB_OFS                    (2)                             /* !< INTRUSB Offset */
#define USB_IMASK_INTRUSB_MASK                   ((uint32_t)0x00000004U)         /* !< USB Interrupts */
#define USB_IMASK_INTRUSB_CLR                    ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USB_IMASK_INTRUSB_SET                    ((uint32_t)0x00000004U)         /* !< Interrupt Enabled. */
/* USB_IMASK[VUSBPWRDN] Bits */
#define USB_IMASK_VUSBPWRDN_OFS                  (3)                             /* !< VUSBPWRDN Offset */
#define USB_IMASK_VUSBPWRDN_MASK                 ((uint32_t)0x00000008U)         /* !< VUSB Power Down */
#define USB_IMASK_VUSBPWRDN_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USB_IMASK_VUSBPWRDN_SET                  ((uint32_t)0x00000008U)         /* !< Interrupt Enabled. */
/* USB_IMASK[DMADONEARX] Bits */
#define USB_IMASK_DMADONEARX_OFS                 (4)                             /* !< DMADONEARX Offset */
#define USB_IMASK_DMADONEARX_MASK                ((uint32_t)0x00000010U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-A-RX */
#define USB_IMASK_DMADONEARX_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USB_IMASK_DMADONEARX_SET                 ((uint32_t)0x00000010U)         /* !< Interrupt Enabled. */
/* USB_IMASK[DMADONEATX] Bits */
#define USB_IMASK_DMADONEATX_OFS                 (5)                             /* !< DMADONEATX Offset */
#define USB_IMASK_DMADONEATX_MASK                ((uint32_t)0x00000020U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-A-TX */
#define USB_IMASK_DMADONEATX_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USB_IMASK_DMADONEATX_SET                 ((uint32_t)0x00000020U)         /* !< Interrupt Enabled. */
/* USB_IMASK[DMADONEBRX] Bits */
#define USB_IMASK_DMADONEBRX_OFS                 (6)                             /* !< DMADONEBRX Offset */
#define USB_IMASK_DMADONEBRX_MASK                ((uint32_t)0x00000040U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-B-RX */
#define USB_IMASK_DMADONEBRX_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USB_IMASK_DMADONEBRX_SET                 ((uint32_t)0x00000040U)         /* !< Interrupt Enabled. */
/* USB_IMASK[DMADONEBTX] Bits */
#define USB_IMASK_DMADONEBTX_OFS                 (7)                             /* !< DMADONEBTX Offset */
#define USB_IMASK_DMADONEBTX_MASK                ((uint32_t)0x00000080U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-B-TX */
#define USB_IMASK_DMADONEBTX_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USB_IMASK_DMADONEBTX_SET                 ((uint32_t)0x00000080U)         /* !< Interrupt Enabled. */
/* USB_IMASK[DMADONECRX] Bits */
#define USB_IMASK_DMADONECRX_OFS                 (8)                             /* !< DMADONECRX Offset */
#define USB_IMASK_DMADONECRX_MASK                ((uint32_t)0x00000100U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-C-RX */
#define USB_IMASK_DMADONECRX_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USB_IMASK_DMADONECRX_SET                 ((uint32_t)0x00000100U)         /* !< Interrupt Enabled. */
/* USB_IMASK[DMADONECTX] Bits */
#define USB_IMASK_DMADONECTX_OFS                 (9)                             /* !< DMADONECTX Offset */
#define USB_IMASK_DMADONECTX_MASK                ((uint32_t)0x00000200U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-C-TX */
#define USB_IMASK_DMADONECTX_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USB_IMASK_DMADONECTX_SET                 ((uint32_t)0x00000200U)         /* !< Interrupt Enabled. */
/* USB_IMASK[DMADONEDRX] Bits */
#define USB_IMASK_DMADONEDRX_OFS                 (10)                            /* !< DMADONEDRX Offset */
#define USB_IMASK_DMADONEDRX_MASK                ((uint32_t)0x00000400U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-D-RX */
#define USB_IMASK_DMADONEDRX_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USB_IMASK_DMADONEDRX_SET                 ((uint32_t)0x00000400U)         /* !< Interrupt Enabled. */
/* USB_IMASK[DMADONEDTX] Bits */
#define USB_IMASK_DMADONEDTX_OFS                 (11)                            /* !< DMADONEDTX Offset */
#define USB_IMASK_DMADONEDTX_MASK                ((uint32_t)0x00000800U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-D-TX */
#define USB_IMASK_DMADONEDTX_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USB_IMASK_DMADONEDTX_SET                 ((uint32_t)0x00000800U)         /* !< Interrupt Enabled. */
/* USB_IMASK[DMAPREARX] Bits */
#define USB_IMASK_DMAPREARX_OFS                  (12)                            /* !< DMAPREARX Offset */
#define USB_IMASK_DMAPREARX_MASK                 ((uint32_t)0x00001000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-A-RX */
#define USB_IMASK_DMAPREARX_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USB_IMASK_DMAPREARX_SET                  ((uint32_t)0x00001000U)         /* !< Interrupt Enabled. */
/* USB_IMASK[DMAPREATX] Bits */
#define USB_IMASK_DMAPREATX_OFS                  (13)                            /* !< DMAPREATX Offset */
#define USB_IMASK_DMAPREATX_MASK                 ((uint32_t)0x00002000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-A-TX */
#define USB_IMASK_DMAPREATX_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USB_IMASK_DMAPREATX_SET                  ((uint32_t)0x00002000U)         /* !< Interrupt Enabled. */
/* USB_IMASK[DMAPREBRX] Bits */
#define USB_IMASK_DMAPREBRX_OFS                  (14)                            /* !< DMAPREBRX Offset */
#define USB_IMASK_DMAPREBRX_MASK                 ((uint32_t)0x00004000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-B-RX */
#define USB_IMASK_DMAPREBRX_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USB_IMASK_DMAPREBRX_SET                  ((uint32_t)0x00004000U)         /* !< Interrupt Enabled. */
/* USB_IMASK[DMAPREBTX] Bits */
#define USB_IMASK_DMAPREBTX_OFS                  (15)                            /* !< DMAPREBTX Offset */
#define USB_IMASK_DMAPREBTX_MASK                 ((uint32_t)0x00008000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-B-TX */
#define USB_IMASK_DMAPREBTX_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USB_IMASK_DMAPREBTX_SET                  ((uint32_t)0x00008000U)         /* !< Interrupt Enabled. */
/* USB_IMASK[DMAPRECRX] Bits */
#define USB_IMASK_DMAPRECRX_OFS                  (16)                            /* !< DMAPRECRX Offset */
#define USB_IMASK_DMAPRECRX_MASK                 ((uint32_t)0x00010000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-C-RX */
#define USB_IMASK_DMAPRECRX_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USB_IMASK_DMAPRECRX_SET                  ((uint32_t)0x00010000U)         /* !< Interrupt Enabled. */
/* USB_IMASK[DMAPRECTX] Bits */
#define USB_IMASK_DMAPRECTX_OFS                  (17)                            /* !< DMAPRECTX Offset */
#define USB_IMASK_DMAPRECTX_MASK                 ((uint32_t)0x00020000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-C-TX */
#define USB_IMASK_DMAPRECTX_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USB_IMASK_DMAPRECTX_SET                  ((uint32_t)0x00020000U)         /* !< Interrupt Enabled. */
/* USB_IMASK[DMAPREDRX] Bits */
#define USB_IMASK_DMAPREDRX_OFS                  (18)                            /* !< DMAPREDRX Offset */
#define USB_IMASK_DMAPREDRX_MASK                 ((uint32_t)0x00040000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-D-RX */
#define USB_IMASK_DMAPREDRX_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USB_IMASK_DMAPREDRX_SET                  ((uint32_t)0x00040000U)         /* !< Interrupt Enabled. */
/* USB_IMASK[DMAPREDTX] Bits */
#define USB_IMASK_DMAPREDTX_OFS                  (19)                            /* !< DMAPREDTX Offset */
#define USB_IMASK_DMAPREDTX_MASK                 ((uint32_t)0x00080000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-D-TX */
#define USB_IMASK_DMAPREDTX_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USB_IMASK_DMAPREDTX_SET                  ((uint32_t)0x00080000U)         /* !< Interrupt Enabled. */

/* USB_RIS Bits */
/* USB_RIS[INTRTX] Bits */
#define USB_RIS_INTRTX_OFS                       (0)                             /* !< INTRTX Offset */
#define USB_RIS_INTRTX_MASK                      ((uint32_t)0x00000001U)         /* !< Endpoint 0 and the TX Endpoints
                                                                                    interrupt */
#define USB_RIS_INTRTX_CLR                       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_RIS_INTRTX_SET                       ((uint32_t)0x00000001U)         /* !< Interrupt occured */
/* USB_RIS[INTRRX] Bits */
#define USB_RIS_INTRRX_OFS                       (1)                             /* !< INTRRX Offset */
#define USB_RIS_INTRRX_MASK                      ((uint32_t)0x00000002U)         /* !< RX Endpoints interrupt */
#define USB_RIS_INTRRX_CLR                       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_RIS_INTRRX_SET                       ((uint32_t)0x00000002U)         /* !< Interrupt occured */
/* USB_RIS[INTRUSB] Bits */
#define USB_RIS_INTRUSB_OFS                      (2)                             /* !< INTRUSB Offset */
#define USB_RIS_INTRUSB_MASK                     ((uint32_t)0x00000004U)         /* !< USB Interrupts */
#define USB_RIS_INTRUSB_CLR                      ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_RIS_INTRUSB_SET                      ((uint32_t)0x00000004U)         /* !< Interrupt occured */
/* USB_RIS[VUSBPWRDN] Bits */
#define USB_RIS_VUSBPWRDN_OFS                    (3)                             /* !< VUSBPWRDN Offset */
#define USB_RIS_VUSBPWRDN_MASK                   ((uint32_t)0x00000008U)         /* !< VUSB Power Down */
#define USB_RIS_VUSBPWRDN_CLR                    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_RIS_VUSBPWRDN_SET                    ((uint32_t)0x00000008U)         /* !< Interrupt occured */
/* USB_RIS[DMADONEARX] Bits */
#define USB_RIS_DMADONEARX_OFS                   (4)                             /* !< DMADONEARX Offset */
#define USB_RIS_DMADONEARX_MASK                  ((uint32_t)0x00000010U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-A-RX */
#define USB_RIS_DMADONEARX_CLR                   ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_RIS_DMADONEARX_SET                   ((uint32_t)0x00000010U)         /* !< Interrupt occured */
/* USB_RIS[DMADONEATX] Bits */
#define USB_RIS_DMADONEATX_OFS                   (5)                             /* !< DMADONEATX Offset */
#define USB_RIS_DMADONEATX_MASK                  ((uint32_t)0x00000020U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-A-TX */
#define USB_RIS_DMADONEATX_CLR                   ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_RIS_DMADONEATX_SET                   ((uint32_t)0x00000020U)         /* !< Interrupt occured */
/* USB_RIS[DMADONEBRX] Bits */
#define USB_RIS_DMADONEBRX_OFS                   (6)                             /* !< DMADONEBRX Offset */
#define USB_RIS_DMADONEBRX_MASK                  ((uint32_t)0x00000040U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-B-RX */
#define USB_RIS_DMADONEBRX_CLR                   ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_RIS_DMADONEBRX_SET                   ((uint32_t)0x00000040U)         /* !< Interrupt occured */
/* USB_RIS[DMADONEBTX] Bits */
#define USB_RIS_DMADONEBTX_OFS                   (7)                             /* !< DMADONEBTX Offset */
#define USB_RIS_DMADONEBTX_MASK                  ((uint32_t)0x00000080U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-B-TX */
#define USB_RIS_DMADONEBTX_CLR                   ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_RIS_DMADONEBTX_SET                   ((uint32_t)0x00000080U)         /* !< Interrupt occured */
/* USB_RIS[DMADONECRX] Bits */
#define USB_RIS_DMADONECRX_OFS                   (8)                             /* !< DMADONECRX Offset */
#define USB_RIS_DMADONECRX_MASK                  ((uint32_t)0x00000100U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-C-RX */
#define USB_RIS_DMADONECRX_CLR                   ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_RIS_DMADONECRX_SET                   ((uint32_t)0x00000100U)         /* !< Interrupt occured */
/* USB_RIS[DMADONECTX] Bits */
#define USB_RIS_DMADONECTX_OFS                   (9)                             /* !< DMADONECTX Offset */
#define USB_RIS_DMADONECTX_MASK                  ((uint32_t)0x00000200U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-C-TX */
#define USB_RIS_DMADONECTX_CLR                   ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_RIS_DMADONECTX_SET                   ((uint32_t)0x00000200U)         /* !< Interrupt occured */
/* USB_RIS[DMADONEDRX] Bits */
#define USB_RIS_DMADONEDRX_OFS                   (10)                            /* !< DMADONEDRX Offset */
#define USB_RIS_DMADONEDRX_MASK                  ((uint32_t)0x00000400U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-D-RX */
#define USB_RIS_DMADONEDRX_CLR                   ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_RIS_DMADONEDRX_SET                   ((uint32_t)0x00000400U)         /* !< Interrupt occured */
/* USB_RIS[DMADONEDTX] Bits */
#define USB_RIS_DMADONEDTX_OFS                   (11)                            /* !< DMADONEDTX Offset */
#define USB_RIS_DMADONEDTX_MASK                  ((uint32_t)0x00000800U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-D-TX */
#define USB_RIS_DMADONEDTX_CLR                   ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_RIS_DMADONEDTX_SET                   ((uint32_t)0x00000800U)         /* !< Interrupt occured */
/* USB_RIS[DMAPREARX] Bits */
#define USB_RIS_DMAPREARX_OFS                    (12)                            /* !< DMAPREARX Offset */
#define USB_RIS_DMAPREARX_MASK                   ((uint32_t)0x00001000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-A-RX */
#define USB_RIS_DMAPREARX_CLR                    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_RIS_DMAPREARX_SET                    ((uint32_t)0x00001000U)         /* !< Interrupt occured */
/* USB_RIS[DMAPREATX] Bits */
#define USB_RIS_DMAPREATX_OFS                    (13)                            /* !< DMAPREATX Offset */
#define USB_RIS_DMAPREATX_MASK                   ((uint32_t)0x00002000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-A-TX */
#define USB_RIS_DMAPREATX_CLR                    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_RIS_DMAPREATX_SET                    ((uint32_t)0x00002000U)         /* !< Interrupt occured */
/* USB_RIS[DMAPREBRX] Bits */
#define USB_RIS_DMAPREBRX_OFS                    (14)                            /* !< DMAPREBRX Offset */
#define USB_RIS_DMAPREBRX_MASK                   ((uint32_t)0x00004000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-B-RX */
#define USB_RIS_DMAPREBRX_CLR                    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_RIS_DMAPREBRX_SET                    ((uint32_t)0x00004000U)         /* !< Interrupt occured */
/* USB_RIS[DMAPREBTX] Bits */
#define USB_RIS_DMAPREBTX_OFS                    (15)                            /* !< DMAPREBTX Offset */
#define USB_RIS_DMAPREBTX_MASK                   ((uint32_t)0x00008000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-B-TX */
#define USB_RIS_DMAPREBTX_CLR                    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_RIS_DMAPREBTX_SET                    ((uint32_t)0x00008000U)         /* !< Interrupt occured */
/* USB_RIS[DMAPRECRX] Bits */
#define USB_RIS_DMAPRECRX_OFS                    (16)                            /* !< DMAPRECRX Offset */
#define USB_RIS_DMAPRECRX_MASK                   ((uint32_t)0x00010000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-C-RX */
#define USB_RIS_DMAPRECRX_CLR                    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_RIS_DMAPRECRX_SET                    ((uint32_t)0x00010000U)         /* !< Interrupt occured */
/* USB_RIS[DMAPRECTX] Bits */
#define USB_RIS_DMAPRECTX_OFS                    (17)                            /* !< DMAPRECTX Offset */
#define USB_RIS_DMAPRECTX_MASK                   ((uint32_t)0x00020000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-C-TX */
#define USB_RIS_DMAPRECTX_CLR                    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_RIS_DMAPRECTX_SET                    ((uint32_t)0x00020000U)         /* !< Interrupt occured */
/* USB_RIS[DMAPREDRX] Bits */
#define USB_RIS_DMAPREDRX_OFS                    (18)                            /* !< DMAPREDRX Offset */
#define USB_RIS_DMAPREDRX_MASK                   ((uint32_t)0x00040000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-D-RX */
#define USB_RIS_DMAPREDRX_CLR                    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_RIS_DMAPREDRX_SET                    ((uint32_t)0x00040000U)         /* !< Interrupt occured */
/* USB_RIS[DMAPREDTX] Bits */
#define USB_RIS_DMAPREDTX_OFS                    (19)                            /* !< DMAPREDTX Offset */
#define USB_RIS_DMAPREDTX_MASK                   ((uint32_t)0x00080000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-D-TX */
#define USB_RIS_DMAPREDTX_CLR                    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_RIS_DMAPREDTX_SET                    ((uint32_t)0x00080000U)         /* !< Interrupt occured */

